Revit 2026 API

# DirectContext3DDocumentUtils Methods

---

The DirectContext3DDocumentUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDirectContext3DHandleInstances | Returns all DirectContext3D handle instances of the given category in the document. |
|  | GetDirectContext3DHandleTypes | Returns all DirectContext3D handle types of the given category in the document. |
|  | IsADirectContext3DHandleCategory | Checks whether the provided category ID is one of the categories used by DirectContext3D handle elements. |
|  | IsADirectContext3DHandleInstance | Checks whether the provided Element ID corresponds to a DirectContext3D handle instance element. |
|  | IsADirectContext3DHandleType | Checks whether the provided Element ID corresponds to a DirectContext3D handle type element. |

#### Reference

DirectContext3DDocumentUtils Class

Autodesk.Revit.DB.DirectContext3D Namespace